import SeoReactHelmet from "../../../shared/SeoReactHelmet";

const ProjectsSeo = () => {
  return (
    <SeoReactHelmet
      title={"المشاريع | شركة الهرم الرابع للاستشارات الهندسية"}
      description={
        "اكتشف قائمة مشاريع شركة الهرم الرابع للاستشارات الهندسية، من تصميمات معمارية متطورة إلى حلول هندسية مبتكرة لتنفيذ المشاريع بجودة عالية ومعايير احترافية."
      }
      keywords={[
        "المشاريع",
        "شركة الهرم الرابع",
        "مشاريع شركة الهرم الرابع",
        "المشاريع الهندسية",
        "استشارات هندسية",
        "مشاريع متكاملة",
        "حلول هندسية",
        "تصميم معماري",
        "إشراف هندسي",
        "تنفيذ المشاريع الهندسية",
        "مشاريع معمارية",
        "مشاريع هندسية كبرى",
        "مشاريع البناء",
        "أفضل المشاريع الهندسية",
        "مشاريع تطوير عقاري",
        "مشاريع تصميم داخلي",
        "مشاريع تخطيط عمراني",
        "شركة الهرم الرابع للمشاريع",
        "شركة استشارات هندسية مصر",
        "مشاريع تنفيذ المخططات الهندسية",
        "تصميم واجهات المشاريع",
        "إدارة المشاريع الهندسية",
        "مشاريع مستدامة",
        "مشاريع هندسة مدنية",
      ]}
      openGraph={{
        type: "website",
        locale: "ar_AR",
        url: "https://www.4th-pyramid.com/projects",
        title: "المشاريع | شركة الهرم الرابع للاستشارات الهندسية",
        description:
          "استعرض المشاريع الهندسية المتميزة التي أنجزتها شركة الهرم الرابع، والتي تجمع بين الإبداع والابتكار والجودة العالية.",
        site_name: "الهرم الرابع للاستشارات الهندسية",
        image: "https://www.4th-pyramid.com/projects-og-image.jpg",
      }}
      twitter={{
        cardType: "summary_large_image",
        site: "@4th-pyramid",
        creator: "@4th-pyramid",
      }}
    />
  );
};

export default ProjectsSeo;
