import SeoReactHelmet from "../../../shared/SeoReactHelmet";

const ServiceSeo = () => {
  return (
    <SeoReactHelmet
      title={"الخدمات | شركة الهرم الرابع للاستشارات الهندسية"}
      description={
        "استكشف خدمات شركة الهرم الرابع للاستشارات الهندسية المتكاملة، بما في ذلك تصميمات هندسية متميزة، استشارات احترافية، وتنفيذ مشاريع هندسية بأعلى معايير الجودة والدقة."
      }
      keywords={[
        "خدمات هندسية",
        "استشارات هندسية",
        "شركة الهرم الرابع",
        "حلول هندسية",
        "تصميم هندسي",
        "تنفيذ مشاريع",
        "خدمات استشارية",
        "تصميم معماري",
        "إشراف هندسي",
        "تصميم داخلي",
        "خدمات تخطيط عمراني",
        "إعداد مخططات تنفيذية",
        "إدارة المشاريع الهندسية",
        "خدمات تصميم الواجهات",
        "تنفيذ مشروعات معمارية",
        "خدمات تطوير عقاري",
        "استشارات في الهندسة المدنية",
        "مشروعات تخطيط المدن",
        "تصميم مستدام",
        "شركات استشارات هندسية مصر",
        "خدمات مبتكرة للمشاريع الهندسية",
        "حلول متكاملة للهندسة المعمارية",
        "أفضل خدمات هندسية",
      ]}
      openGraph={{
        type: "website",
        locale: "ar_AR",
        url: "https://www.4th-pyramid.com/services",
        title: "الخدمات | شركة الهرم الرابع للاستشارات الهندسية",
        description:
          "تعرف على الخدمات الهندسية المبتكرة التي تقدمها شركة الهرم الرابع، من تصميم معماري وإشراف هندسي إلى إدارة مشاريع متكاملة.",
        site_name: "الهرم الرابع للاستشارات الهندسية",
        image: "https://www.4th-pyramid.com/services-og-image.jpg",
      }}
      twitter={{
        cardType: "summary_large_image",
        site: "@4th-pyramid",
        creator: "@4th-pyramid",
      }}
    />
  );
};

export default ServiceSeo;
