import Security from "@/assets/services/Professional Security Work.webp";
import Structural from "@/assets/services/Structural design.webp";
import Structural_Design from "@/assets/services/Structural Design (2).webp";
import project_management from "@/assets/services/project management.webp";
import Interior_design from "@/assets/services/Interior design.webp";
import Electromechanical from "@/assets/services/Electromechanical design.webp";
import Engineering_Monitoring from "@/assets/services/EngineeringMonitoring.webp";
import Building_permits from "@/assets/services/Buildingpermits.webp";
import Surveying from "@/assets/services/Surveying.webp";
export const cardDetails = [
  {
    title: "الأمن والسلامة المهنية",
    details: `
      - إعداد خطط السلامة والإجراءات الوقائية اللازمة.
      - تحديد وتقييم المخاطر الموجودة في بيئة العمل.
      - تدريب الموظفين على إجراءات الأمن والسلامة وكيفية التصرف في حالات الطوارئ.
      - إجراء تفتيش دوري لضمان الالتزام بمعايير السلامة.
      - توفير التقارير والوثائق اللازمة التي توثق إجراءات السلامة.
    `,
    image: Security,
  },
  {
    title: "التصميم المعماري",
    details: `
      - الاجتماع مع العميل لتحديد احتياجات المشروع وتفاصيله.
      - دراسة اشتراطات الكود السعودي للبناء وتحديد المعايير واللوائح ذات الصلة.
      - إعداد المخططات الأولية التي تتماشى مع المتطلبات الوظيفية وتراعي المتطلبات القانونية.
      - عرض المخططات على العميل للمراجعة وتلقي الملاحظات.
      - مراجعة وتطوير المخططات بما يتوافق مع معايير الكود السعودي للبناء.
      - التنسيق مع الجهات المختصة لمراجعة واعتماد المخططات المعمارية.
      - إعداد وتقديم المستندات المطلوبة للحصول على رخصة البناء.
      - متابعة الطلبات المقدمة مع الجهات المعنية لضمان سرعة الحصول على الرخصة.
      - التواصل مع العميل لإبلاغه بتطورات العملية وتقديم الدعم اللازم حتى استلام الرخصة.
    `,
    image: Structural_Design,
  },
  {
    title: "التصميم الإنشائي",
    details: `
      - تحليل احتياجات المشروع وتقديم المشورة الفنية المناسبة.
      - إعداد المخططات الإنشائية الشاملة التي تتضمن جميع التفاصيل الفنية.
      - إجراء حسابات دقيقة للأحمال والهياكل باستخدام برامج تحليل متقدمة.
      - توثيق الحسابات الإنشائية وإعداد نوتة حسابية شاملة.
      - مراجعة النتائج وتحليلها لضمان سلامة وكفاءة البناء.
    `,
    image: Structural,
  },
  {
    title: "إدارة المشاريع",
    details: `
      - إعداد خطة شاملة لتنفيذ المشروع بما يتضمن الأهداف والمواعيد الزمنية.
      - تنظيم وتوزيع الموارد البشرية والمالية لضمان فعالية التنفيذ.
      - متابعة تقدم المشروع وتحديد المخاطر المحتملة ومعالجتها.
      - تطبيق استراتيجيات إدارة الجودة لضمان الالتزام بالمعايير المطلوبة.
      - إعداد تقارير دورية لمتابعة سير المشروع وتقديمها للجهات المعنية.
    `,
    image: project_management,
  },
  {
    title: "التصميم الداخلي",
    details: `
      - الاجتماع مع العميل لتحديد متطلباته ورؤيته للمساحة.
      - إعداد تصميمات مفصلة تشمل توزيع الأثاث والإضاءة والمواد.
      - اختيار الألوان والمواد التي تتناسب مع ذوق العميل وتحقق الأهداف الوظيفية.
      - إعداد عروض ثلاثية الأبعاد لتمثيل التصاميم بشكل واقعي.
      - متابعة تنفيذ التصميم والتأكد من الالتزام بالتصاميم المعتمدة.
    `,
    image: Interior_design,
  },
  {
    title: "تصميم الالكتروميانيك",
    details: `
      - إعداد مخططات الأنظمة الكهربائية والميكانيكية اللازمة للمشروع.
      - تصميم أنظمة التهوية والتكييف والتدفئة والتغذيه والصرف بما يتوافق مع معايير الكفاءة.
      - تحديد احتياجات المشروع من الطاقة وضمان تكامل الأنظمة.
      - إجراء اختبارات لمحاكاة الأداء وضمان عمل الأنظمة بكفاءة.
    `,
  
  },
  {
    title: "الإشراف الهندسي",
    details: `
      - متابعة تنفيذ المشروع بشكل يومي لضمان مطابقته للمخططات المعتمدة.
      - فحص جودة المواد المستخدمة ومراقبة عمليات التركيب.
      - تقديم توجيهات فنية في حال ظهور أي مشكلات أثناء التنفيذ.
      - إعداد تقارير متابعة دورية توضح التقدم والمشكلات المحتملة.
      - التواصل مع الفريق الهندسي والعميل لإطلاعهم على آخر المستجدات.
    `,
    image: Engineering_Monitoring,
  },
  {
    title: "رخص البناء",
    details: `
      - جمع المستندات والمخططات اللازمة للحصول على الرخصة.
      - تقديم الطلبات للجهات المختصة ومتابعتها لضمان سير العملية.
      - التنسيق مع الجهات المعنية للحصول على الموافقات النهائية.
      - تقديم الدعم للعميل حتى استلام رخصة البناء بشكل كامل.
    `,
    image: Building_permits,
  },
  {
    title: "الرفع المساحي",
    details: `
      - استخدام أدوات متقدمة لجمع البيانات الجغرافية الدقيقة للموقع.
      - إعداد مخططات تفصيلية تشمل التضاريس والارتفاعات والمساحات.
      - تحديد حدود الملكية وإعداد التقارير اللازمة للمشروع.
      - توفير بيانات دقيقة تسهل عملية التصميم والتنفيذ.
    `,
    image: Surveying,
  },
];
